use School;

-- Вставка школьных должностей в таблицу Positions
INSERT INTO Positions (Name, Description, Salary)
VALUES 
    ('Учитель математики', 'Преподает математику в школьных классах', 45000.00),
    ('Учитель русского языка', 'Преподает русский язык и литературу в школьных классах', 46000.00),
    ('Учитель физики', 'Преподает физику и ведет лабораторные занятия', 47000.00),
    ('Учитель биологии', 'Преподает биологию и организует практические занятия', 46000.00),
    ('Учитель химии', 'Преподает химию, проводит лабораторные работы', 47000.00),
    ('Учитель истории', 'Преподает историю и обществознание в школьных классах', 45000.00),
    ('Учитель иностранных языков', 'Преподает английский, немецкий и другие языки', 48000.00),
    ('Классный руководитель', 'Организует работу с классом, взаимодействует с учениками и их родителями', 49000.00),
    ('Директор школы', 'Руководит деятельностью учебного заведения', 70000.00),
    ('Заместитель директора по учебной части', 'Координирует учебный процесс и взаимодействует с преподавателями', 65000.00),
    ('Заместитель директора по воспитательной работе', 'Занимается организацией воспитательной работы в школе', 64000.00),
    ('Школьный психолог', 'Консультирует учащихся и их родителей по вопросам психологии', 55000.00),
    ('Библиотекарь', 'Обслуживает школьную библиотеку и организует работу с книгами', 40000.00),
    ('Техник', 'Обслуживает и ремонтирует школьное оборудование и технику', 42000.00),
    ('Вахтер', 'Контролирует безопасность и вход/выход на территорию школы', 30000.00);
